Repository: Francesco146/telegram-file-statistics-bot
Catalog: locales/*/LC_MESSAGES/*.po
Languages: it

source: File path is None
it: Il percorso del file è nullo

source: Error handling zip file: %s
it: Errore durante la gestione del file zip: %s

source: Processing file
it: Processo il file

source: File received via archive
it: File ricevuto tramite archivio

source: Database path not set.
it: Percorso del database non impostato.

source: 🏠 Home
it: 🏠 Casa

source: 📊 View Statistics
it: 📊 Visualizza Statistiche

source: ⌫ Reset Statistics
it: ⌫ Reimposta Statistiche

source: 🆘 Help
it: 🆘 Aiuto

source: Archives are not supported in non-local mode.
it: Gli archivi non sono supportati in modalità non locale.

source: Processing archive
it: Processo l'archivio

source: This may take some time.
it: Questo potrebbe richiedere del tempo.

source: Error handling zip file.
it: Errore durante la gestione del file zip.

source: Archive received
it: Archivio ricevuto

source: File received
it: File ricevuto

source: Error handling file: %s
it: Errore durante la gestione del file: %s

source: Error handling file.
it: Errore durante la gestione del file.

source: files
it: file

source: Total file size
it: Spazio totale dei file

source: Total download size
it: Spazio totale da scaricare

source: Number of files uploaded
it: Numero di file caricati

source: Streamable files
it: File riproducibili

source: videos
it: video

source: Extensions
it: Estensioni

source: No files uploaded yet.
it: Nessun file caricato ancora.

source: files
it: file

source: Error getting stats: %s
it: Errore durante il recupero delle statistiche: %s

source: Error getting statistics.
it: Errore durante il recupero delle statistiche.

source: Statistics reset successfully.
it: Statistiche reimpostate con successo.

source: Error resetting stats: %s
it: Errore durante la reimpostazione delle statistiche: %s

source: Error resetting statistics.
it: Errore durante la reimpostazione delle statistiche.

source: Start the bot and get information on how to use it.
it: Avvia il bot e ottieni informazioni su come utilizzarlo.

source: View statistics on uploaded files.
it: Visualizza le statistiche sui file caricati.

source: Reset the statistics.
it: Reimposta le statistiche.

source: Show this help message.
it: Mostra questo messaggio di aiuto.

source: You can also send documents and receive summaries on their size and more.
it: Puoi anche inviare documenti e ricevere riepiloghi sulle loro dimensioni e altro.

source: Unknown action: %s
it: Azione sconosciuta: %s

source: Unknown action. Please try again.
it: Azione sconosciuta. Riprova.

source: Update does not contain a message or callback query
it: L'aggiornamento non contiene un messaggio o una query di richiamo

source: Telegram Bot for File Statistics
it: Bot Telegram per le statistiche sui file

source: Made with ❤️ by @Francesco146
it: Realizzato con ❤️ da @Francesco146

source: Bot token (or set TELEGRAM_TOKEN environment variable)
it: Token del bot (o impostare la variabile d'ambiente TELEGRAM_TOKEN)

source: Path to the SQLite database file
it: Percorso del file del database SQLite

source: Enable debug mode for logging
it: Abilita la modalità di debug per il logging

source: Show the version of the program
it: Mostra la versione del programma

source: Run the bot in a telegram api bot local server
it: Esegui il bot in un server locale di telegram api bot

source: Token not provided. Exiting...
it: Token non fornito. Uscita...

source: Bot is starting...
it: Bot in avvio...

source: Make sure the local server is running.
it: Assicurati che il server locale sia in esecuzione.

source: Environment variable DATABASE_FILE is overridden by the command-line argument.
it: La variabile d'ambiente DATABASE_FILE è sovrascritta dall'argomento della riga di comando.

source: Environment variable DEBUG_MODE is overridden by the command-line argument.
it: La variabile d'ambiente DEBUG_MODE è sovrascritta dall'argomento della riga di comando.

source: Environment variable TELEGRAM_TOKEN is overridden by the command-line argument.
it: La variabile d'ambiente TELEGRAM_TOKEN è sovrascritta dall'argomento della riga di comando.

source: Environment variable LOCAL_SERVER_MODE is overridden by the command-line argument.
it: La variabile d'ambiente LOCAL_SERVER_MODE è sovrascritta dall'argomento della riga di comando.

source: Current configuration:
it: Configurazione attuale:

source: * language: %s
it: * lingua: %s

source: * local: %s
it: * modalità locale: %s
